Repository: pingfangx/TranslatorX-other
Catalog: GitDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Commit Ordering
zh_cn: 提交排序

source: Commits modifying the given <paths> are selected.
zh_cn: 选择修改给定的<paths>的提交。

source: Commits that are referred by some branch or tag are selected.
zh_cn: 选择某些分支或标签引用的提交。

source: Commits to cherry-pick.
zh_cn: 要 cherry-pick 的提交。

source: Commits to revert.
zh_cn: 要恢复的提交。

source: Commits with more than one parent represent merges of independent lines of development.
zh_cn: 使用多个父提交的提交表示独立开发线的合并。

source: Common Git shell script setup code
zh_cn: 常见的 Git shell 脚本设置代码

source: Community
zh_cn: 社区

source: Compare a tree to the working tree or index
zh_cn: 将树与工作树或索引进行比较

source: Compare the version before the last commit and the last commit.
zh_cn: 比较上次提交之前的版本和最后一次提交。

source: Compared to --bare, --mirror not only maps local branches of the source to local branches of the target, it maps all refs (including remote-tracking branches, notes etc.) and sets up a refspec configuration such that all these refs are overwritten by a git remote update in the target repository.
zh_cn: 与 --bare 相比，不仅将源的本地分支映射到目标的本地分支，它映射所有引用(包括远程跟踪分支，注释等等)，并设置一个 refspec 配置，以便所有这些引用被目标仓库中的 git remote update 覆盖。

source: Compares files in the working tree and the index
zh_cn: 比较工作树和索引中的文件

source: Compares the content and mode of blobs found via two tree objects
zh_cn: 比较两个树对象找到的 blob 的内容和模式

source: Compares the content and mode of the blobs found in a tree object with the corresponding tracked files in the working tree, or with the corresponding paths in the index.
zh_cn: 将树对象中发现的 blob 的内容和模式与工作树中的相应跟踪文件或索引中的相应路径进行比较。

source: Comparing branches
zh_cn: 比较分支

source: Comparing with arbitrary commits
zh_cn: 与任意提交相比

source: Composing
zh_cn: 构成

source: Comprehensive reference documentation is available through the man pages, or git-help[1] command.
zh_cn: 详尽的参考文档可通过手册页或 git-help[1] 命令获得。

source: Compute object ID and optionally creates a blob from a file
zh_cn: 计算对象 ID，并可选择从文件创建一个 blob

source: Compute unique ID for a patch
zh_cn: 计算补丁的唯一 ID

source: Computes the object ID value for an object with specified type with the contents of the named file (which can be outside of the work tree), and optionally writes the resulting object into the object database.
zh_cn: 计算具有指定类型的对象的对象 ID 值，该对象具有指定文件的内容(可以在工作树之外)，并且可选地将生成的对象写入对象数据库。

source: Configuration
zh_cn: 配置

source: Configuration Mechanism
zh_cn: 配置机制

source: Configuring remote-tracking branches
zh_cn: 配置远程跟踪分支

source: Considers adding content from all git-*.sh scripts:
zh_cn: 考虑从所有 git-*.sh 脚本添加内容：

source: Construct a commit message for use with rebase --autosquash.
zh_cn: 构造一个提交消息，用于 rebase --autosquash 。

source: Content which does not differ between the index and working tree may be shown on context lines, beginning with a " " (space).
zh_cn: 在索引和工作树之间没有不同的内容可以在上下文行中显示，从 " " (空格)开始。

source: Continue the operation in progress using the information in .git/sequencer.
zh_cn: 使用 .git/sequencer 中的信息继续进行中的操作。

source: Copy files from the index to the working tree
zh_cn: 将文件从索引复制到工作树

source: Count unpacked number of objects and their disk consumption
zh_cn: 统计未打包的对象数量及其磁盘消耗

source: Countermand commit.gpgSign configuration variable that is set to force each and every commit to be signed.
zh_cn: 取消 commit.gpgSign 设置为强制每个提交签名的配置变量。

source: Counting the number of commits on a branch
zh_cn: 计算分支上的提交数量

source: Create a /path/to/my/codebase/.git directory.
zh_cn: 创建一个 /path/to/my/codebase/.git 目录。

source: Create a shallow clone with a history truncated to the specified number of commits.
zh_cn: 创建具有截断到指定数量的提交的历史记录的 shallow 克隆。

source: Create a bare repository to publish your changes to the public:
zh_cn: 创建一个裸仓库以将您的更改发布给公众：

source: Create a bare repository.
zh_cn: 创建一个裸仓库。

source: Create a new branch named <new_branch> and start it at <start_point>; see git-branch[1] for details.
zh_cn: 创建一个名为<new_branch>的新分支，并从<start_point>开始;详见 git-branch[1] 。

source: Create a new commit object
zh_cn: 创建一个新的提交对象

source: Create a packed archive of objects
zh_cn: 创建对象的打包归档

source: Create a shallow clone with a history after the specified time.
zh_cn: 在指定时间后创建具有历史记录的浅克隆。

source: Create a shallow clone with a history, excluding commits reachable from a specified remote branch or tag.
zh_cn: 创建具有历史记录的浅克隆，不包括从指定的远程分支或标记可访问的提交。

source: Create a stash entry (which is a regular commit object) and return its object name, without storing it anywhere in the ref namespace.
zh_cn: 创建一个 stash 条目(它是一个常规的提交对象)并返回其对象名称，而不将其存储在 ref 命名空间中的任何位置。

source: Create a topic branch and develop.
zh_cn: 创建一个主题分支并开发。

source: Create a tree object from the current index
zh_cn: 从当前索引创建树对象

source: Create an archive of files from a named tree
zh_cn: 从命名树创建文件的归档

source: Create an empty Git repository or reinitialize an existing one
zh_cn: 创建一个空的 Git 仓库或重新初始化一个现有的仓库

source: Create the branch experimental in the origin repository by copying the current master branch.
zh_cn: 通过复制当前 master 分支，在 origin 仓库中创建分支 experimental 。

source: Create, list, delete or verify a tag object signed with GPG
zh_cn: 创建，列出，删除或使用 GPG 签名检验标签对象

source: Create, list, delete refs to replace objects
zh_cn: 创建，列出，删除参考以替换对象

source: Creates a tag object
zh_cn: 创建标签对象

source: Creates a temporary file with a blob’s contents
zh_cn: 创建一个带有 Blob 内容的临时文件

source: Creates a tree object using the current index.
zh_cn: 使用当前索引创建树对象。

source: Creates an archive of the specified format containing the tree structure for the named tree, and writes it out to the standard output.
zh_cn: 创建包含指定树的树结构的指定格式的存档，并将其写入标准输出。

source: Creates the branch <new_branch> and start it at <start_point>; if it already exists, then reset it to <start_point>.
zh_cn: 创建分支<new_branch>并在<start_point>启动它;如果它已经存在，则将其重置为<start_point>。

source: Creating a changelog and tarball for a software release
zh_cn: 为软件版本创建 changelog 和 tarball

source: Creating a new repository
zh_cn: 创建一个新的仓库

source: Creating good commit messages
zh_cn: 创建好的提交消息

source: Creating tags
zh_cn: 创建标签

source: Creating the perfect patch series
zh_cn: 创建完美的补丁系列

source: Currently for internal use only.
zh_cn: 目前仅供内部使用。

source: Currently one of: blob, tree, commit, or tag.
zh_cn: 目前为 blob ，tree，commit或tag之一。

source: Currently only git-instaweb[1] and git-help[1] may use it.
zh_cn: 目前，只有 git-instaweb[1] 和 git-help[1] 可能会使用它。

source: Custom commit list format to use during an --interactive rebase.
zh_cn: 在 --interactive 的 rebase 期间使用的自定义提交列表格式。

source: Cutting down bisection by giving more parameters to bisect start
zh_cn: 通过在二分开始时给予更多的参数以减少二分

source: DATE FORMATS
zh_cn: 日期格式

source: DEFAULT BEHAVIOUR
zh_cn: 默认行为

source: DESCRIPTION
zh_cn: 描述

source: DISCUSSION
zh_cn: 讨论

source: DISTRIBUTED WORKFLOWS
zh_cn: 分布式工作流程

source: Dangling objects
zh_cn: 悬挂对象

source: Debug gitignore / exclude files
zh_cn: 调试 gitignore / 排除文件

source: Debugging
zh_cn: 调试

source: Default behavior is to replace at most one line.
zh_cn: 默认行为是最多替换一行。

source: Default values for <repository> and <branch> are read from the "remote" and "merge" configuration for the current branch as set by git-branch[1] --track.
zh_cn: <repository> 和 <branch> 的默认值是当前分支的 "remote" 和 "merge" 配置，由 git-branch[1] --track 设置。

source: Defaults to off when a specific file is given (e.g., using --file, --global, etc) and on when searching all config files.
zh_cn: 默认为 off 当给定特定文件(例如，使用 --file ， --global 等)时，当搜索所有配置文件时为 on 。

source: Defaults to HEAD.
zh_cn: 默认为 HEAD。

source: Defaults to on, but can be used to override configuration variable commit.status.
zh_cn: 默认为 on，但可用于覆盖配置变量 commit.status。

source: Defaults to the configured upstream for the current branch.
zh_cn: 默认为当前分支配置的上游。

source: Defines a URL from which the submodule repository can be cloned.
zh_cn: 定义从中可以克隆子模块仓库的 URL。

source: Defines the path, relative to the top-level directory of the Git working tree, where the submodule is expected to be checked out.
zh_cn: 定义相对于 Git 工作树顶层目录的路径，子模块预计将被检出。

source: Delete a branch.
zh_cn: 删除一个分支。

source: Delete an unneeded branch
zh_cn: 删除不需要的分支

source: Delete existing tags with the given names.
zh_cn: 删除具有给定名称的现有标签。

source: Delete the "test" branch even if the "master" branch (or whichever branch is currently checked out) does not have all commits from the test branch.
zh_cn: 删除“test”分支，即使“master”分支(或当前签出的分支)没有来自该 test 分支的所有提交。

source: Delete the remote-tracking branches "todo", "html" and "man".
zh_cn: 删除远程跟踪分支“todo”，“html”和“man”。

source: Depending on the command, they denote a specific commit or, for commands which walk the revision graph (such as git-log[1]), all commits which are reachable from that commit.
zh_cn: 根据命令，它们表示特定的提交，或者对于 walk 修订图(例如 git-log[1] )的命令，表示可以从该提交可访问的所有提交。

source: Depending on the transport protocol, some of this information may be absent.
zh_cn: 根据传输协议，有些信息可能不存在。

source: Describe a commit using the most recent tag reachable from it
zh_cn: 使用可从其访问的最新标记来描述提交

source: Developers of such porcelains might start by reading about git-update-index[1] and git-read-tree[1].
zh_cn: 这些高级命令的开发可以从阅读关于 git-update-index[1] 和 git-read-tree[1] 开始。

source: Developing with Git
zh_cn: 用 Git 开发

source: Diff Formatting
zh_cn: 差异格式化

source: Disabling globbing on individual pathspecs can be done using pathspec magic ":(literal)"
zh_cn: 禁用个别路径规则上的 globbing 可以使用路径规则魔术 ":(literal)"

source: Discussion
zh_cn: 讨论

source: Display data in columns
zh_cn: 以列显示数据

source: Display gitattributes information
zh_cn: 显示 gitattributes 信息

source: Display help information about Git
zh_cn: 显示有关 Git 的帮助信息

source: Display manual page for the command in the info format.
zh_cn: 在 info 格式显示该命令的手册页。

source: Display manual page for the command in the man format.
zh_cn: 显示 man 格式的命令的手册页。

source: Display manual page for the command in the web (HTML) format.
zh_cn: 显示 web (HTML)格式的命令手册页。

source: Displays paths that have differences between the index file and the current HEAD commit, paths that have differences between the working tree and the index file, and paths in the working tree that are not tracked by Git (and are not ignored by gitignore[5]).
zh_cn: 显示索引和当前 HEAD 提交之间有差异的文件，在工作树和索引之间有差异的文件，以及工作树中未被 Git 跟踪的路径（并且不被 gitignore[5] 忽略）。

source: Displays references available in a local repository along with the associated commit IDs.
zh_cn: 显示本地仓库中可用的引用以及关联的提交 ID。

source: Do not do this if you have already given these commits to somebody else.
zh_cn: 如果您已经向其他人提交了这些提交，请 不要 执行。

source: Do not use this option unless you have read git-rebase[1] carefully.
zh_cn: 除非您仔细阅读 git-rebase[1] ，否则请 不要 使用此选项。

source: Do everything except actually send the updates.
zh_cn: 做所有事情，除了实际发送更新。

source: Do not always take them literally; you should value good reasons for your actions higher than manpages such as this one.
zh_cn: 不要总是把它们从字面上看;你应该重视你的行为比这个手册页面更好的理由。

source: Do not change the message at all.
zh_cn: 完全不要更改消息。

source: Do not create a commit, but show a list of paths that are to be committed, paths with local changes that will be left uncommitted and paths that are untracked.
zh_cn: 不要创建提交，而是显示要提交的路径的列表，具有未被提交的本地更改的路径和未被跟踪的路径。

source: Do not include the output of git-status[1] in the commit message template when using an editor to prepare the default commit message.
zh_cn: 当使用编辑器准备默认提交消息时，不要在提交消息模板中包含 git-status[1] 的输出。

source: Do not interpret any more arguments as options.
zh_cn: 不要将任何更多的参数解释为选项。

source: Do not pipe Git output into a pager.
zh_cn: 不要将 Git 输出管道传输到 pager。

source: Do not use replacement refs to replace Git objects.
zh_cn: 不要使用替换参考来替换 Git 对象。

source: Do nothing; only show what would happen
zh_cn: 什么也不做;只显示会发生什么

source: Documentation
zh_cn: 文档

source: Does not affect the reporting of progress status to the standard error stream.
zh_cn: 不影响标准错误流的进度状态报告。

source: Does not touch the index file or the working tree at all (but resets the head to <commit>, just like all modes do).
zh_cn: 根本没有触及索引文件或工作树(但是将头重置为<commit>，就像所有模式一样)。

source: Don’t actually add the file(s), just show if they exist and/or will be ignored.
zh_cn: 不要实际上添加文件，只显示它们是否存在和/或将被忽略。

source: Don’t actually remove any file(s).
zh_cn: 实际上不会移除任何文件。

source: Don’t actually remove anything, just show what would be done.
zh_cn: 实际上没有移除任何东西，只是显示将要做什么。

source: Don’t add the file(s), but only refresh their stat() information in the index.
zh_cn: 不要添加文件，而只能在索引中刷新其 stat() 信息。

source: Don’t use the standard ignore rules read from .gitignore (per directory) and $GIT_DIR/info/exclude, but do still use the ignore rules given with -e options.
zh_cn: 不要使用从 .gitignore(每个目录)和 $GIT_DIR/info/exclude 读取的标准忽略规则，但仍然使用由 -e 选项给出的忽略规则。

source: Download from a remote Git repository via HTTP
zh_cn: 通过 HTTP 从远程 Git 仓库下载

source: Download objects and refs from another repository
zh_cn: 从另一个仓库下载对象和引用

source: Downloads
zh_cn: 下载

source: Due to the immutable nature of Git objects, old objects can be archived into shared, read-only directories.
zh_cn: 由于 Git 对象的不变性质，旧对象可以归档到共享的只读目录中。

source: E.g, format:"The author of %h was %an, %ar%nThe title was >>%s<<%n" would show something like this:
zh_cn: 例如， format:"The author of %h was %an, %ar%nThe title was >>%s<<%n" 将显示如下：

source: E.g. "*.c *.h" will excludes files end with ".c" and ".h" from deletion.
zh_cn: 例如。 "*.c *.h" 将排除以 ".c" 和 ".h" 结尾的文件。

source: E.g. "2-5 7,9" to choose 2,3,4,5,7,9 from the list.
zh_cn: 例如， "2-5 7,9"从列表中选择2,3,4,5,7,9。

source: E.g. "7-" to choose 7,8,9 from the list.
zh_cn: 例如。 "7-"从列表中选择7,8,9。

source: E.g. dae86e1950b1277e545cee180551750029cfe735 and dae86e both name the same commit object if there is no other object in your repository whose object name starts with dae86e.
zh_cn: 例如 dae86e1950b1277e545cee180551750029cfe735 和 dae86e 都指定相同的提交对象，如果您的仓库中没有其他对象，其对象名称以 dae86e 开头。

source: E.g. you can use master:.gitmodules to read values from the file .gitmodules in the master branch.
zh_cn: 例如。您可以使用 master:.gitmodules 从主分支中的文件 .gitmodules 读取值。

source: E.g., the value `"path-with-\"-and-:-in-it":vanilla-path` has two paths: `path-with-"-and-:-in-it` and `vanilla-path`.
zh_cn: 如，值 `"path-with-\"-and-:-in-it":vanilla-path` 有 2 个路径： `path-with-"-and-:-in-it` 和 `vanilla-path`.

source: EDITING PATCHES
zh_cn: 编辑补丁

source: ENVIRONMENT
zh_cn: 环境

source: ENVIRONMENT AND CONFIGURATION VARIABLES
zh_cn: 环境与配置变量

source: EXAMPLE
zh_cn: 例子

source: EXAMPLES
zh_cn: 例子

source: Each stash entry is listed with its name (e.g. stash@{0} is the latest entry, stash@{1} is the one before, etc.), the name of the branch that was current when the entry was made, and a short description of the commit the entry was based on.
zh_cn: 每个 stash entry 列出其名称(例如 stash@{0} 是最新条目， stash@{1} 是之前的，等等)，作为条目时当前的分支的名称，以及该条目所基于的提交的简短描述。

source: Each attribute can be in one of these states for a given path:
zh_cn: 对于给定的路径，每个属性可以处于这些状态之一：

source: Each commit will be grouped by author and title.
zh_cn: 每个提交将按作者和标题分组。

source: Each file mentioned is updated into the index and any unmerged or needs updating state is cleared.
zh_cn: 所提到的每个文件被更新为索引，并且任何 unmerged 或 needs updating 状态被清除。

source: Each line in gitattributes file is of form:
zh_cn: gitattributes 文件中的每一行格式如下：

source: Each line in a gitignore file specifies a pattern.
zh_cn: gitignore 文件中的每一行都指定一个模式。

source: Each submodule section also contains the following required keys:
zh_cn: 每个子模块部分还包含以下所需的 key：

source: Edit and resolve the conflict and mark it resolved with git add as usual:
zh_cn: 修改并解决冲突，并按照常规使用 git add 将其标记为已解决:

source: Email
zh_cn: 邮件

source: Enables a curl full trace dump of all incoming and outgoing data, including descriptive information, of the git transport protocol.
zh_cn: 启用 git 传输协议的所有传入和传出数据（包括描述性信息）的卷曲完整跟踪转储。

source: Enables general trace messages, e.g. alias expansion, built-in command execution and external command execution.
zh_cn: 启用常规跟踪消息，例如 别名扩展，内置命令执行和外部命令执行。

source: Enables performance related trace messages, e.g. total execution time of each Git command.
zh_cn: 启用与性能相关的跟踪消息，例如 每个Git命令的总执行时间。

source: Enables trace messages for all accesses to any packs.
zh_cn: 启用对任何包的所有访问的跟踪消息。

source: Enables trace messages for all packets coming in or out of a given program.
zh_cn: 启用给定程序进出的所有数据包的跟踪消息。

source: Enables trace messages printing the .git, working tree and current working directory after Git has completed its setup phase.
zh_cn: 在 Git 完成设置阶段后，启用跟踪消息打印.git，工作树和当前工作目录。

source: Enables trace messages that can help debugging fetching / cloning of shallow repositories.
zh_cn: 启用可帮助调试获取/克隆浅库的跟踪消息。

source: Enables tracing of packfiles sent or received by a given program.
zh_cn: 启用跟踪给定程序发送或接收的包文件。

source: Enabling globbing on individual pathspecs can be done using pathspec magic ":(glob)"
zh_cn: 在个别路径规则上启用 globbing 可以使用路径规则魔术 ":(glob)"

source: Ensures that a reference name is well formed
zh_cn: 确保引用名称格式良好

source: Ensuring good performance
zh_cn: 确保良好的性能

source: Ensuring reliability
zh_cn: 确保可靠性

source: Entries older than expire time, or entries older than expire-unreachable time and not reachable from the current tip, are removed from the reflog.
zh_cn: 时间长于 expire 到期的时间，或者比 expire-unreachable 时间长的条目，从当前尖端无法到达，将从 reflog 中删除。

source: Entries that begin with `"` (double-quote) will be interpreted as C-style quoted paths, removing leading and trailing double-quotes and respecting backslash escapes.
zh_cn: 以 `"` (双引号)开头的条目将被解析为 C 风格引用的路径，删除前导和尾随的双引号， 并支持反斜杠转义。

source: Environment Variables
zh_cn: 环境变量

source: Equivalent to setting the GIT_NAMESPACE environment variable.
zh_cn: 相当于设置 GIT_NAMESPACE 环境变量。

source: Everyday Git With 20 Commands Or So
zh_cn: 日常 git 有20个命令

source: Examining an old version without creating a new branch
zh_cn: 检查旧版本而不创建新的分支

source: Examining branches from a remote repository
zh_cn: 从远程仓库检查分支

source: Examining dangling objects
zh_cn: 检查悬挂对象

source: Examining the data
zh_cn: 检查数据

source: Example
zh_cn: 例子

source: Example to exclude everything except a specific directory foo/bar (note the /* - without the slash, the wildcard would also exclude everything within foo/bar):
zh_cn: 除了特定目录 foo/bar 外都排除的例子(注意 /* - 没有斜线，通配符也将排除 foo/bar 中的所有东西)：

source: Examples
zh_cn: 例子

source: Exit with a zero status even if no files matched.
zh_cn: 退出零状态即使没有文件匹配。

source: Exploring Git history
zh_cn: 探索 Git 历史

source: Exploring history
zh_cn: 探索历史

source: Export a single commit to a CVS checkout
zh_cn: 将单个提交导出到 CVS 检出

source: Exporting a Git repository via the Git protocol
zh_cn: 通过 Git 协议导出 Git 仓库

source: Exporting a git repository via HTTP
zh_cn: 通过 HTTP 导出 git 仓库

source: External Links
zh_cn: 外部链接

source: External Systems
zh_cn: 外部系统

source: Extract commit ID from an archive created using git-archive
zh_cn: 从使用 git-archive 创建的存档中提取提交 ID

source: Extracts patch and authorship from a single e-mail message
zh_cn: 从单个电子邮件中提取补丁和作者

source: FILES
zh_cn: 文件

source: FURTHER DOCUMENTATION
zh_cn: 进一步的文档

source: False by default.
zh_cn: 默认为 false。

source: Fast-forward merges
zh_cn: 快速合并

source: Feed changes to upstream.
zh_cn: 反馈更改到上游。

source: Fetch all remotes.
zh_cn: 抓取所有的远程。

source: Fetch branches and/or tags (collectively, "refs") from one or more other repositories, along with the objects necessary to complete their histories.
zh_cn: 从一个或多个其他仓库中抓取分支和/或标签(统称为"参考")，以及完成其历史所必需的对象。

source: Fetch from and integrate with another repository or a local branch
zh_cn: 从另一个仓库或本地分支获取并集成

source: Fetching a branch means to get the branch’s head ref from a remote repository, to find out which objects are missing from the local object database, and to get them, too.
zh_cn: 获取 branch 意味着从远程 repository 获取分支的 head ref ，以查找本地 object database 缺少的对象，并获取它们。

source: Fetching branches from other repositories
zh_cn: 从其他仓库获取分支

source: Fetching individual branches
zh_cn: 获取个别分支

source: File globbing matches across directory boundaries.
zh_cn: 文件 globbing 在目录边界之间进行匹配。

source: File/Directory Structure
zh_cn: 文件/目录结构

source: Fileglobs (e.g. *.c) can be given to add all matching files.
zh_cn: 可以给出 Fileglobs(例如 *.c )来添加所有匹配的文件。

source: Fileglobs (e.g. *.c) can be given to remove all matching files.
zh_cn: 可以给出 Fileglobs(例如 *.c )来移除所有匹配的文件。

source: Files already tracked by Git are not affected; see the NOTES below for details.
zh_cn: Git 已跟踪的文件不受影响;有关详细信息，请参阅下面的注意。

source: Files to add content from.
zh_cn: 要添加内容的文件。

source: Files to remove.
zh_cn: 要删除的文件。

source: Finally, see Appendix B: Notes and todo list for this manual for ways that you can help make this manual more complete.
zh_cn: 最后，有关可以帮助使本手册更加完整的方式，请参阅 附录B：本手册的备注和待办清单 。

source: Find a ref that matches experimental in the origin repository (e.g. refs/heads/experimental), and delete it.
zh_cn: 在 origin 资源库中找到与 experimental 匹配的引用(例如 refs/heads/experimental )，并将其删除。

source: Find a ref that matches master in the source repository (most likely, it would find refs/heads/master), and update the same ref (e.g. refs/heads/master) in origin repository with it.
zh_cn: 在源仓库中查找与 master 匹配的引用(很可能会找到 refs/heads/master )，并在 origin 仓库中更新相同的引用(例如 refs/heads/master )。

source: Find as good common ancestors as possible for a merge
zh_cn: 找到尽可能好的共同祖先进行合并

source: Find commits yet to be applied to upstream
zh_cn: 查找尚未应用于上游的提交

source: Find first tagged version including a given fix
zh_cn: 查找包含给定修复的第一个标签版本

source: Find redundant pack files
zh_cn: 查找冗余包文件

source: Find symbolic names for given revs
zh_cn: 找到给定修订的符号名称

source: Find the color configured for name (e.g. color.diff.new) and output it as the ANSI color escape sequence to the standard output.
zh_cn: 找到为 name (例如 color.diff.new )配置的颜色，并将其作为 ANSI 颜色转义序列输出到标准输出。

source: Find the color setting for name (e.g. color.diff) and output "true" or "false".
zh_cn: 找到 name (例如 color.diff )的颜色设置，并输出“true”或“false”。

source: Finding commits referencing a file with given content
zh_cn: 查找引用给定内容的文件的提交

source: First let’s assume your topic is based on branch next.
zh_cn: 首先假定您的 topic 是基于分支 next 。

source: First, note that you can get documentation for a command such as git log --graph with:
zh_cn: 首先，请注意，您可以使用诸如 git log --graph 的命令获取命令的文档：

source: Fixing a mistake by rewriting history
zh_cn: 通过重写历史来修正错误

source: Fixing a mistake with a new commit
zh_cn: 用新的提交修复错误

source: Fixing mistakes
zh_cn: 修正错误

source: For a more complete list of ways to spell <commit>, see "SPECIFYING REVISIONS" section in gitrevisions[7].
zh_cn: 有关拼写 <commit> 的更完整的方法列表，请参阅 gitrevisions[7] 中的"指定版本"部分。

source: For a more complete list of ways to spell commit names, see gitrevisions[7].
zh_cn: 有关拼写提交名称的更完整的方法列表，请参见 gitrevisions[7] 。

source: For a more complete list of ways to spell commits, see gitrevisions[7].
zh_cn: 有关拼写提交的更完整的方法列表，请参阅 gitrevisions[7] 。

source: For a more complete list of ways to spell object names, see "SPECIFYING REVISIONS" section in gitrevisions[7].
zh_cn: 有关拼写对象名称的更完整的方法列表，请参阅 gitrevisions[7] 中的"指定版本"部分。

source: For a more complete list of ways to spell object names, see the "SPECIFYING REVISIONS" section in gitrevisions[7].
zh_cn: 有关拼写对象名称的更完整的方法列表，请参阅 gitrevisions[7] 中的 "指定版本" 部分。

source: For a path that is added, removed, or modified, GIT_EXTERNAL_DIFF is called with 7 parameters:
zh_cn: 对于添加，删除或修改的路径，使用7个参数调用 GIT_EXTERNAL_DIFF ：

source: For a path that is unmerged, GIT_EXTERNAL_DIFF is called with 1 parameter, <path>.
zh_cn: 对于未合并的路径，使用1个参数<path>调用 GIT_EXTERNAL_DIFF 。

source: For all options that output values and/or keys, always end values with the null character (instead of a newline).
zh_cn: 对于输出值和/或键的所有选项，始终使用空字符结束值(而不是换行符)。

source: For command-specific variables, you will find a more detailed description in the appropriate manual page.
zh_cn: 对于特定于命令的变量，您将在相应的手册页面中找到更详细的描述。

source: For commands that walk the revision graph one can also specify a range of revisions explicitly.
zh_cn: 对于 walk 修订图的命令，还可以明确指定修订的范围。

source: For commits it shows the log message and textual diff.
zh_cn: 对于提交，它显示日志消息和文本差异。
